podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ZLL_MKW41Z4.svd.xml
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRCV_MSK</name>
                     <description>Transceiver Global Interrupt Mask</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Enable any unmasked interrupt source to assert zigbee interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Mask all interrupt sources from asserting zigbee interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVENT_TMR</name>
               <description>EVENT TIMER</description>
               <addressOffset>0x8</addressOffset>
               <resetMask>0xF</resetMask>
               <fields>
                  <field>
                     <name>EVENT_TMR_LD</name>
                     <description>Event Timer Load Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EVENT_TMR_ADD</name>
                     <description>Event Timer Add Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EVENT_TMR_FRAC</name>
                     <description>Event Timer Fractional Component</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EVENT_TMR</name>
                     <description>Event Timer Integer Component</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMESTAMP</name>
               <description>TIMESTAMP</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <resetMask>0xFF000000</resetMask>
               <fields>
                  <field>
                     <name>TIMESTAMP</name>
                     <description>Timestamp</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>T1CMP</name>
               <description>T1 COMPARE</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0xFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>T1CMP</name>
                     <description>TMR1 Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>T2CMP</name>
               <description>T2 COMPARE</description>
               <addressOffset>0x14</addressOffset>
               <resetValue>0xFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>T2CMP</name>
                     <description>TMR2 Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>T2PRIMECMP</name>
               <description>T2 PRIME COMPARE</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>T2PRIMECMP</name>
                     <description>TMR2 Prime Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>T3CMP</name>
               <description>T3 COMPARE</description>
               <addressOffset>0x1C</addressOffset>
               <resetValue>0xFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>T3CMP</name>
                     <description>TMR3 Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>T4CMP</name>
               <description>T4 COMPARE</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0xFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>T4CMP</name>
                     <description>TMR4 Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PA_PWR</name>
               <description>PA POWER</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>PA_PWR</name>
                     <description>PA Power</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHANNEL_NUM0</name>
               <description>CHANNEL NUMBER 0</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x12</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL_NUM0</name>
                     <description>Channel Number for PAN0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LQI_AND_RSSI</name>
               <description>LQI AND RSSI</description>
               <addressOffset>0x2C</addressOffset>
               <access>read-only</access>
               <resetMask>0xFF000000</resetMask>
               <fields>
                  <field>
                     <name>LQI_VALUE</name>
                     <description>LQI Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RSSI</name>
                     <description>RSSI Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CCA1_ED_FNL</name>
                     <description>Final Result for CCA Mode 1 and Energy Detect</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACSHORTADDRS0</name>
               <description>MAC SHORT ADDRESS 0</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>MACPANID0</name>
                     <description>MAC PAN ID for PAN0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MACSHORTADDRS0</name>
                     <description>MAC SHORT ADDRESS FOR PAN0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACLONGADDRS0_LSB</name>
               <description>MAC LONG ADDRESS 0 LSB</description>
               <addressOffset>0x34</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>MACLONGADDRS0_LSB</name>
                     <description>MAC LONG ADDRESS for PAN0 LSB</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACLONGADDRS0_MSB</name>
               <description>MAC LONG ADDRESS 0 MSB</description>
               <addressOffset>0x38</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>MACLONGADDRS0_MSB</name>
                     <description>MAC LONG ADDRESS for PAN0 MSB</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
