podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ZLL_MKW41Z4.svd.xml
            <register>
               <name>DUAL_PAN_CTRL</name>
               <description>DUAL PAN CONTROL</description>
               <addressOffset>0x60</addressOffset>
               <resetMask>0xFF00FFF7</resetMask>
               <fields>
                  <field>
                     <name>ACTIVE_NETWORK</name>
                     <description>Active Network Selector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Select PAN0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Select PAN1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DUAL_PAN_AUTO</name>
                     <description>Activates automatic Dual PAN operating mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PANCORDNTR1</name>
                     <description>Device is a PAN Coordinator on PAN1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CURRENT_NETWORK</name>
                     <description>Indicates which PAN is currently selected by hardware</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PAN0 is selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PAN1 is selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZB_DP_CHAN_OVRD_EN</name>
                     <description>Dual PAN Channel Override Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZB_DP_CHAN_OVRD_SEL</name>
                     <description>Dual PAN Channel Override Selector</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL_PAN_DWELL</name>
                     <description>Dual PAN Channel Frequency Dwell Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DUAL_PAN_REMAIN</name>
                     <description>Time Remaining before next PAN switch in auto Dual PAN mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RECD_ON_PAN0</name>
                     <description>Last Packet was Received on PAN0</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RECD_ON_PAN1</name>
                     <description>Last Packet was Received on PAN1</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHANNEL_NUM1</name>
               <description>CHANNEL NUMBER 1</description>
               <addressOffset>0x64</addressOffset>
               <resetValue>0x7F</resetValue>
               <fields>
                  <field>
                     <name>CHANNEL_NUM1</name>
                     <description>Channel Number for PAN1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAM_CTRL</name>
               <description>SAM CONTROL</description>
               <addressOffset>0x68</addressOffset>
               <resetValue>0x80804000</resetValue>
               <fields>
                  <field>
                     <name>SAP0_EN</name>
                     <description>Enables SAP0 Partition of the SAM Table</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables SAP0 Partition</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables SAP0 Partition</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAA0_EN</name>
                     <description>Enables SAA0 Partition of the SAM Table</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables SAA0 Partition</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables SAA0 Partition</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAP1_EN</name>
                     <description>Enables SAP1 Partition of the SAM Table</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables SAP1 Partition</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables SAP1 Partition</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAA1_EN</name>
                     <description>Enables SAA1 Partition of the SAM Table</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables SAA1 Partition</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables SAA1 Partition</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAA0_START</name>
                     <description>First Index of SAA0 partition</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAP1_START</name>
                     <description>First Index of SAP1 partition</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAA1_START</name>
                     <description>First Index of SAA1 partition</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAM_TABLE</name>
               <description>SOURCE ADDRESS MANAGEMENT TABLE</description>
               <addressOffset>0x6C</addressOffset>
               <resetMask>0x4C00007F</resetMask>
               <fields>
                  <field>
                     <name>SAM_INDEX</name>
                     <description>Contains the SAM table index to be enabled or invalidated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SAM_INDEX_WR</name>
                     <description>Enables SAM Table Contents to be updated</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SAM_CHECKSUM</name>
                     <description>Software-computed source address checksum, to be installed into a table index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SAM_INDEX_INV</name>
                     <description>Invalidate the SAM table index selected by SAM_INDEX</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SAM_INDEX_EN</name>
                     <description>Enable the SAM table index selected by SAM_INDEX</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>ACK_FRM_PND</name>
                     <description>State of AutoTxAck FramePending field when SAM Accelleration is Disabled</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACK_FRM_PND_CTRL</name>
                     <description>Manual Control for AutoTxAck FramePending field</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>the FramePending field of the Frame Control Field of the next automatic TX acknowledge packet is determined by hardware</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>the FramePending field of the Frame Control Field of the next automatic TX acknowledge packet tracks ACK_FRM_PEND</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIND_FREE_IDX</name>
                     <description>Find First Free Index</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>INVALIDATE_ALL</name>
                     <description>Invalidate Entire SAM Table</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SAM_BUSY</name>
                     <description>SAM Table Update Status Bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAM_MATCH</name>
               <description>SOURCE ADDRESS MANAGEMENT MATCH</description>
               <addressOffset>0x70</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SAP0_MATCH</name>
                     <description>Index in the SAP0 Partition of the SAM Table corresponding to the first checksum match</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SAP0_ADDR_PRESENT</name>
                     <description>A Checksum Match is Present in the SAP0 Partition of the SAM Table</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAA0_MATCH</name>
                     <description>Index in the SAA0 Partition of the SAM Table corresponding to the first checksum match</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SAA0_ADDR_ABSENT</name>
                     <description>A Checksum Match is Absent in the SAA0 Partition of the SAM Table</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAP1_MATCH</name>
                     <description>Index in the SAP1 Partition of the SAM Table corresponding to the first checksum match</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SAP1_ADDR_PRESENT</name>
                     <description>A Checksum Match is Present in the SAP1 Partition of the SAM Table</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAA1_MATCH</name>
                     <description>Index in the SAA1 Partition of the SAM Table corresponding to the first checksum match</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SAA1_ADDR_ABSENT</name>
                     <description>A Checksum Match is Absent in the SAP1 Partition of the SAM Table</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAM_FREE_IDX</name>
               <description>SAM FREE INDEX</description>
               <addressOffset>0x74</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SAP0_1ST_FREE_IDX</name>
                     <description>First non-enabled (invalid) index in the SAP0 partition</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAA0_1ST_FREE_IDX</name>
                     <description>First non-enabled (invalid) index in the SAA0 partition</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAP1_1ST_FREE_IDX</name>
                     <description>First non-enabled (invalid) index in the SAP1 partition</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAA1_1ST_FREE_IDX</name>
                     <description>First non-enabled (invalid) index in the SAA1 partition</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
